[NoCoverage] BlockStatement
src/App.jsx:4:16
 import Register from "./Register";
 import Login from "./Login";
 import StudentDetails from "./StudentDetails";
-function App() {
-  return <StudentDetails />;
-}
+function App() {}
 
 export default App;
