[NoCoverage] StringLiteral
src/Login.jsx:8:34
   const errRef = useRef();
 
   const [user, setUser] = useState("");
-  const [pwd, setPwd] = useState("");
+  const [pwd, setPwd] = useState("Stryker was here!");
   const [errMsg, setErrMsg] = useState("");
   const [success, setSuccess] = useState(false);

[NoCoverage] BlockStatement
src/Login.jsx:12:19
   const [errMsg, setErrMsg] = useState("");
   const [success, setSuccess] = useState(false);
 
-  useEffect(() => {
-    userRef.current.focus();
-  }, []);
+  useEffect(() => {}, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/Login.jsx:16:19
     userRef.current.focus();
   }, []);
 
-  useEffect(() => {
-    setErrMsg("");
-  }, [user, pwd]);
+  useEffect(() => {}, [user, pwd]);
 
   async function handleSubmit(e) {

[NoCoverage] BlockStatement
src/Login.jsx:20:34
     setErrMsg("");
   }, [user, pwd]);
 
-  async function handleSubmit(e) {
-    e.preventDefault();
-    console.log(user, pwd);
-    setUser("");
-    setPwd("");
-    setSuccess(true);
-  }
+  async function handleSubmit(e) {}
   return (
     <>

[NoCoverage] StringLiteral
src/Login.jsx:23:13
   async function handleSubmit(e) {
     e.preventDefault();
     console.log(user, pwd);
-    setUser("");
+    setUser("Stryker was here!");
     setPwd("");
     setSuccess(true);

[NoCoverage] StringLiteral
src/Login.jsx:24:12
     e.preventDefault();
     console.log(user, pwd);
     setUser("");
-    setPwd("");
+    setPwd("Stryker was here!");
     setSuccess(true);
   }

[NoCoverage] BooleanLiteral
src/Login.jsx:25:16
     console.log(user, pwd);
     setUser("");
     setPwd("");
-    setSuccess(true);
+    setSuccess(false);
   }
   return (
