[NoCoverage] StringLiteral
src/main.jsx:6:36
 import "./index.css";
 import App from "./App";
 
-createRoot(document.getElementById("root")).render(
+createRoot(document.getElementById("")).render(
   <StrictMode>
     <App />
