[Survived] Regex
src/Register.jsx:11:20
 import axios from "./api/axios";
 import React from "react";
 
-const USER_REGEX = /^[A-z][A-z0-9-_]{3,23}$/;
+const USER_REGEX = /^[A-z][A-z0-9-_]{3,23}/;
 const PWD_REGEX = /^(?=.*[a-z])(?=.*[A-Z])(?=.*[0-9])(?=.*[!@#$%]).{8,24}$/;
 const REGISTER_URL = "/register";

[Killed] Regex
src/Register.jsx:12:19
 import React from "react";
 
 const USER_REGEX = /^[A-z][A-z0-9-_]{3,23}$/;
-const PWD_REGEX = /^(?=.*[a-z])(?=.*[A-Z])(?=.*[0-9])(?=.*[!@#$%]).{8,24}$/;
+const PWD_REGEX = /^(?!.*[a-z])(?=.*[A-Z])(?=.*[0-9])(?=.*[!@#$%]).{8,24}$/;
 const REGISTER_URL = "/register";
 
killedBy: Register Component submits the form successfully
statusReason: Error: Unable to find an element with the text: /success/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Survived] Regex
src/Register.jsx:12:19
 import React from "react";
 
 const USER_REGEX = /^[A-z][A-z0-9-_]{3,23}$/;
-const PWD_REGEX = /^(?=.*[a-z])(?=.*[A-Z])(?=.*[0-9])(?=.*[!@#$%]).{8,24}$/;
+const PWD_REGEX = /^(?=.*[a-z])(?=.*[^A-Z])(?=.*[0-9])(?=.*[!@#$%]).{8,24}$/;
 const REGISTER_URL = "/register";
 

[Survived] StringLiteral
src/Register.jsx:19:36
   const userRef = useRef();
   const errRef = useRef();
 
-  const [user, setUser] = useState("");
+  const [user, setUser] = useState("Stryker was here!");
   const [validName, setValidName] = useState(false);
   const [userFocus, setUserFocus] = useState(false);

[Survived] BooleanLiteral
src/Register.jsx:20:46
   const errRef = useRef();
 
   const [user, setUser] = useState("");
-  const [validName, setValidName] = useState(false);
+  const [validName, setValidName] = useState(true);
   const [userFocus, setUserFocus] = useState(false);
 

[Survived] BooleanLiteral
src/Register.jsx:21:46
 
   const [user, setUser] = useState("");
   const [validName, setValidName] = useState(false);
-  const [userFocus, setUserFocus] = useState(false);
+  const [userFocus, setUserFocus] = useState(true);
 
   const [pwd, setPwd] = useState("");

[Survived] BooleanLiteral
src/Register.jsx:24:44
   const [userFocus, setUserFocus] = useState(false);
 
   const [pwd, setPwd] = useState("");
-  const [validPwd, setValidPwd] = useState(false);
+  const [validPwd, setValidPwd] = useState(true);
   const [pwdFocus, setPwdFocus] = useState(false);
 

[Survived] BooleanLiteral
src/Register.jsx:25:44
 
   const [pwd, setPwd] = useState("");
   const [validPwd, setValidPwd] = useState(false);
-  const [pwdFocus, setPwdFocus] = useState(false);
+  const [pwdFocus, setPwdFocus] = useState(true);
 
   const [matchPwd, setMatchPwd] = useState("");

[Survived] BooleanLiteral
src/Register.jsx:28:48
   const [pwdFocus, setPwdFocus] = useState(false);
 
   const [matchPwd, setMatchPwd] = useState("");
-  const [validMatch, setValidMatch] = useState(false);
+  const [validMatch, setValidMatch] = useState(true);
   const [matchFocus, setMatchFocus] = useState(false);
 

[Survived] BooleanLiteral
src/Register.jsx:29:48
 
   const [matchPwd, setMatchPwd] = useState("");
   const [validMatch, setValidMatch] = useState(false);
-  const [matchFocus, setMatchFocus] = useState(false);
+  const [matchFocus, setMatchFocus] = useState(true);
 
   const [errMsg, setErrMsg] = useState("");

[Survived] StringLiteral
src/Register.jsx:31:40
   const [validMatch, setValidMatch] = useState(false);
   const [matchFocus, setMatchFocus] = useState(false);
 
-  const [errMsg, setErrMsg] = useState("");
+  const [errMsg, setErrMsg] = useState("Stryker was here!");
   const [success, setSuccess] = useState(false);
   useEffect(() => {

[Killed] BooleanLiteral
src/Register.jsx:32:42
   const [matchFocus, setMatchFocus] = useState(false);
 
   const [errMsg, setErrMsg] = useState("");
-  const [success, setSuccess] = useState(false);
+  const [success, setSuccess] = useState(true);
   useEffect(() => {
     userRef.current.focus();
killedBy: Register Component renders register form
statusReason: TypeError: Cannot read properties of undefined (reading 'focus')

[Killed] BlockStatement
src/Register.jsx:33:19
 
   const [errMsg, setErrMsg] = useState("");
   const [success, setSuccess] = useState(false);
-  useEffect(() => {
-    userRef.current.focus();
-  }, []);
+  useEffect(() => {}, []);
 
   useEffect(() => {
killedBy: Register Component username field gets auto-focused on render
statusReason: Error: expect(element).toHaveFocus()

Expected element with focus:
  <input aria-describedby="uidnote" aria-invalid="true" autocomplete="off" id="username" required="" type="text" />
Received element with focus:

[Survived] ArrayDeclaration
src/Register.jsx:35:6
   const [success, setSuccess] = useState(false);
   useEffect(() => {
     userRef.current.focus();
-  }, []);
+  }, ["Stryker was here"]);
 
   useEffect(() => {

[Timeout] BlockStatement
src/Register.jsx:37:19
     userRef.current.focus();
   }, []);
 
-  useEffect(() => {
-    const result = USER_REGEX.test(user);
-    console.log(result);
-    console.log(user);
-    setValidName(result);
-  }, [user]);
+  useEffect(() => {}, [user]);
 
   useEffect(() => {

[Killed] ArrayDeclaration
src/Register.jsx:42:6
     console.log(result);
     console.log(user);
     setValidName(result);
-  }, [user]);
+  }, []);
 
   useEffect(() => {
killedBy: Register Component submits the form successfully
statusReason: Error: Unable to find an element with the text: /success/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Killed] BlockStatement
src/Register.jsx:44:19
     setValidName(result);
   }, [user]);
 
-  useEffect(() => {
-    const result = PWD_REGEX.test(pwd);
-    console.log(result);
-    console.log(pwd);
-    setValidPwd(result);
-    const match = pwd === matchPwd;
-    setValidMatch(match);
-  }, [pwd, matchPwd]);
+  useEffect(() => {}, [pwd, matchPwd]);
 
   useEffect(() => {
killedBy: Register Component submits the form successfully
statusReason: Error: Unable to find an element with the text: /success/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Killed] EqualityOperator
src/Register.jsx:49:19
     console.log(result);
     console.log(pwd);
     setValidPwd(result);
-    const match = pwd === matchPwd;
+    const match = pwd !== matchPwd;
     setValidMatch(match);
   }, [pwd, matchPwd]);
killedBy: Register Component submits the form successfully
statusReason: Error: Unable to find an element with the text: /success/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Killed] ConditionalExpression
src/Register.jsx:49:19
     console.log(result);
     console.log(pwd);
     setValidPwd(result);
-    const match = pwd === matchPwd;
+    const match = true;
     setValidMatch(match);
   }, [pwd, matchPwd]);
killedBy: Register Component prevents submission when fields are empty
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button />

[Survived] BlockStatement
src/Register.jsx:53:19
     setValidMatch(match);
   }, [pwd, matchPwd]);
 
-  useEffect(() => {
-    setErrMsg("");
-  }, [user, pwd, matchPwd]);
+  useEffect(() => {}, [user, pwd, matchPwd]);
 
   async function handleSubmit(e) {

[Survived] ArrayDeclaration
src/Register.jsx:55:6
 
   useEffect(() => {
     setErrMsg("");
-  }, [user, pwd, matchPwd]);
+  }, []);
 
   async function handleSubmit(e) {

[Killed] BooleanLiteral
src/Register.jsx:63:9
     const v1 = USER_REGEX.test(user);
     const v2 = PWD_REGEX.test(pwd);
 
-    if (!v1 || !v2) {
+    if (v1 || !v2) {
       setErrMsg("Invalid Entry");
       return;
killedBy: Register Component submits the form successfully
statusReason: Error: Unable to find an element with the text: /success/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Killed] BooleanLiteral
src/Register.jsx:63:16
     const v1 = USER_REGEX.test(user);
     const v2 = PWD_REGEX.test(pwd);
 
-    if (!v1 || !v2) {
+    if (!v1 || v2) {
       setErrMsg("Invalid Entry");
       return;
killedBy: Register Component submits the form successfully
statusReason: Error: Unable to find an element with the text: /success/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Killed] BlockStatement
src/Register.jsx:68:9
       return;
     }
 
-    try {
-      const response = await axios.post(
-        REGISTER_URL,
-        JSON.stringify({ user, pwd }),
-        {
-          headers: { "Content-Type": "application/json" },
-          // withCredentials: true,
-        }
-      );
-      console.log(response.data);
-      console.log(response.accessToken);
-      console.log(JSON.stringify(response));
-      setSuccess(true);
-    } catch (err) {
+    try {} catch (err) {
       if (!err?.response) {
         setErrMsg("No Server Response");
killedBy: Register Component submits the form successfully
statusReason: Error: Unable to find an element with the text: /success/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Killed] ObjectLiteral
src/Register.jsx:71:24
     try {
       const response = await axios.post(
         REGISTER_URL,
-        JSON.stringify({ user, pwd }),
+        JSON.stringify({}),
         {
           headers: { "Content-Type": "application/json" },
killedBy: Register Component submits the form successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/register", "{\"user\":\"validUser\",\"pwd\":\"Valid123!\"}", ObjectContaining {"headers": {"Content-Type": "application/json"}}
Received: "/register", "{}", {"headers": {"Content-Type": "application/json"}}

Number of calls: 1

[Killed] ObjectLiteral
src/Register.jsx:72:9
       const response = await axios.post(
         REGISTER_URL,
         JSON.stringify({ user, pwd }),
-        {
-          headers: { "Content-Type": "application/json" },
-          // withCredentials: true,
-        }
+        {}
       );
       console.log(response.data);
killedBy: Register Component submits the form successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/register", "{\"user\":\"validUser\",\"pwd\":\"Valid123!\"}", ObjectContaining {"headers": {"Content-Type": "application/json"}}
Received: "/register", "{\"user\":\"validUser\",\"pwd\":\"Valid123!\"}", {}

Number of calls: 1

[Killed] StringLiteral
src/Register.jsx:73:38
         REGISTER_URL,
         JSON.stringify({ user, pwd }),
         {
-          headers: { "Content-Type": "application/json" },
+          headers: { "Content-Type": "" },
           // withCredentials: true,
         }
killedBy: Register Component submits the form successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/register", "{\"user\":\"validUser\",\"pwd\":\"Valid123!\"}", ObjectContaining {"headers": {"Content-Type": "application/json"}}
Received: "/register", "{\"user\":\"validUser\",\"pwd\":\"Valid123!\"}", {"headers": {"Content-Type": ""}}

Number of calls: 1

[Killed] BooleanLiteral
src/Register.jsx:80:18
       console.log(response.data);
       console.log(response.accessToken);
       console.log(JSON.stringify(response));
-      setSuccess(true);
+      setSuccess(false);
     } catch (err) {
       if (!err?.response) {
killedBy: Register Component submits the form successfully
statusReason: Error: Unable to find an element with the text: /success/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Killed] BlockStatement
src/Register.jsx:81:19
       console.log(response.accessToken);
       console.log(JSON.stringify(response));
       setSuccess(true);
-    } catch (err) {
-      if (!err?.response) {
-        setErrMsg("No Server Response");
-      } else if (err.response?.status === 409) {
-        setErrMsg("Username Taken");
-      } else {
-        setErrMsg("Registration Failed");
-      }
-    }
+    } catch (err) {}
   }
 
killedBy: Register Component handles server error response
statusReason: Error: Unable to find an element with the text: /registration failed/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Killed] ConditionalExpression
src/Register.jsx:82:11
       console.log(JSON.stringify(response));
       setSuccess(true);
     } catch (err) {
-      if (!err?.response) {
+      if (false) {
         setErrMsg("No Server Response");
       } else if (err.response?.status === 409) {
killedBy: Register Component displays 'No Server Response' on network failure
statusReason: Error: Unable to find an element with the text: /no server response/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Killed] ConditionalExpression
src/Register.jsx:82:11
       console.log(JSON.stringify(response));
       setSuccess(true);
     } catch (err) {
-      if (!err?.response) {
+      if (true) {
         setErrMsg("No Server Response");
       } else if (err.response?.status === 409) {
killedBy: Register Component handles server error response
statusReason: Error: Unable to find an element with the text: /registration failed/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Killed] BlockStatement
src/Register.jsx:84:48
     } catch (err) {
       if (!err?.response) {
         setErrMsg("No Server Response");
-      } else if (err.response?.status === 409) {
-        setErrMsg("Username Taken");
-      } else {
+      } else if (err.response?.status === 409) {} else {
         setErrMsg("Registration Failed");
       }
killedBy: Register Component displays error message for duplicate username
statusReason: Error: Unable to find an element with the text: /username taken/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Killed] ConditionalExpression
src/Register.jsx:84:18
     } catch (err) {
       if (!err?.response) {
         setErrMsg("No Server Response");
-      } else if (err.response?.status === 409) {
+      } else if (false) {
         setErrMsg("Username Taken");
       } else {
killedBy: Register Component displays error message for duplicate username
statusReason: Error: Unable to find an element with the text: /username taken/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Killed] BlockStatement
src/Register.jsx:86:14
         setErrMsg("No Server Response");
       } else if (err.response?.status === 409) {
         setErrMsg("Username Taken");
-      } else {
-        setErrMsg("Registration Failed");
-      }
+      } else {}
     }
   }
killedBy: Register Component handles server error response
statusReason: Error: Unable to find an element with the text: /registration failed/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Survived] StringLiteral
src/Register.jsx:116:40
               Username:
               <FontAwesomeIcon
                 icon={faCheck}
-                className={validName ? "valid" : "hide"}
+                className={validName ? "" : "hide"}
               />
               <FontAwesomeIcon

[Survived] LogicalOperator
src/Register.jsx:120:28
               />
               <FontAwesomeIcon
                 icon={faTimes}
-                className={validName || !user ? "hide" : "invalid"}
+                className={validName && !user ? "hide" : "invalid"}
               />
             </label>

[Survived] BooleanLiteral
src/Register.jsx:120:41
               />
               <FontAwesomeIcon
                 icon={faTimes}
-                className={validName || !user ? "hide" : "invalid"}
+                className={validName || user ? "hide" : "invalid"}
               />
             </label>

[Killed] ArrowFunction
src/Register.jsx:128:25
               id="username"
               ref={userRef}
               autoComplete="off"
-              onChange={(e) => setUser(e.target.value)}
+              onChange={() => undefined}
               required
               aria-invalid={validName ? "false" : "true"}
killedBy: Register Component submits the form successfully
statusReason: Error: Unable to find an element with the text: /success/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Survived] BooleanLiteral
src/Register.jsx:132:43
               required
               aria-invalid={validName ? "false" : "true"}
               aria-describedby="uidnote"
-              onFocus={() => setUserFocus(true)}
+              onFocus={() => setUserFocus(false)}
               onBlur={() => setUserFocus(false)}
             />

[Survived] ArrowFunction
src/Register.jsx:132:24
               required
               aria-invalid={validName ? "false" : "true"}
               aria-describedby="uidnote"
-              onFocus={() => setUserFocus(true)}
+              onFocus={() => undefined}
               onBlur={() => setUserFocus(false)}
             />

[Survived] BooleanLiteral
src/Register.jsx:133:42
               aria-invalid={validName ? "false" : "true"}
               aria-describedby="uidnote"
               onFocus={() => setUserFocus(true)}
-              onBlur={() => setUserFocus(false)}
+              onBlur={() => setUserFocus(true)}
             />
 

[Survived] ArrowFunction
src/Register.jsx:133:23
               aria-invalid={validName ? "false" : "true"}
               aria-describedby="uidnote"
               onFocus={() => setUserFocus(true)}
-              onBlur={() => setUserFocus(false)}
+              onBlur={() => undefined}
             />
 

[Survived] BooleanLiteral
src/Register.jsx:139:38
             <p
               id="uidnote"
               className={
-                userFocus && user && !validName ? "instructions" : "offscreen"
+                userFocus && user && validName ? "instructions" : "offscreen"
               }
             >

[Survived] LogicalOperator
src/Register.jsx:139:17
             <p
               id="uidnote"
               className={
-                userFocus && user && !validName ? "instructions" : "offscreen"
+                userFocus && user || !validName ? "instructions" : "offscreen"
               }
             >

[Survived] StringLiteral
src/Register.jsx:154:39
               Password:
               <FontAwesomeIcon
                 icon={faCheck}
-                className={validPwd ? "valid" : "hide"}
+                className={validPwd ? "" : "hide"}
               />
               <FontAwesomeIcon

[Survived] StringLiteral
src/Register.jsx:154:49
               Password:
               <FontAwesomeIcon
                 icon={faCheck}
-                className={validPwd ? "valid" : "hide"}
+                className={validPwd ? "valid" : ""}
               />
               <FontAwesomeIcon

[Survived] ConditionalExpression
src/Register.jsx:158:28
               />
               <FontAwesomeIcon
                 icon={faTimes}
-                className={validPwd || !pwd ? "hide" : "invalid"}
+                className={true ? "hide" : "invalid"}
               />
             </label>

[Survived] LogicalOperator
src/Register.jsx:158:28
               />
               <FontAwesomeIcon
                 icon={faTimes}
-                className={validPwd || !pwd ? "hide" : "invalid"}
+                className={validPwd && !pwd ? "hide" : "invalid"}
               />
             </label>

[Killed] ArrowFunction
src/Register.jsx:164:25
             <input
               type="password"
               id="password"
-              onChange={(e) => setPwd(e.target.value)}
+              onChange={() => undefined}
               value={pwd}
               required
killedBy: Register Component submits the form successfully
statusReason: Error: Unable to find an element with the text: /success/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[Survived] StringLiteral
src/Register.jsx:167:40
               onChange={(e) => setPwd(e.target.value)}
               value={pwd}
               required
-              aria-invalid={validPwd ? "false" : "true"}
+              aria-invalid={validPwd ? "" : "true"}
               aria-describedby="pwdnote"
               onFocus={() => setPwdFocus(true)}

[Survived] ArrowFunction
src/Register.jsx:169:24
               required
               aria-invalid={validPwd ? "false" : "true"}
               aria-describedby="pwdnote"
-              onFocus={() => setPwdFocus(true)}
+              onFocus={() => undefined}
               onBlur={() => setPwdFocus(false)}
               autoComplete="off"

[NoCoverage] BooleanLiteral
src/Register.jsx:169:42
               required
               aria-invalid={validPwd ? "false" : "true"}
               aria-describedby="pwdnote"
-              onFocus={() => setPwdFocus(true)}
+              onFocus={() => setPwdFocus(false)}
               onBlur={() => setPwdFocus(false)}
               autoComplete="off"

[Survived] BooleanLiteral
src/Register.jsx:170:41
               aria-invalid={validPwd ? "false" : "true"}
               aria-describedby="pwdnote"
               onFocus={() => setPwdFocus(true)}
-              onBlur={() => setPwdFocus(false)}
+              onBlur={() => setPwdFocus(true)}
               autoComplete="off"
             />

[Survived] ArrowFunction
src/Register.jsx:170:23
               aria-invalid={validPwd ? "false" : "true"}
               aria-describedby="pwdnote"
               onFocus={() => setPwdFocus(true)}
-              onBlur={() => setPwdFocus(false)}
+              onBlur={() => undefined}
               autoComplete="off"
             />

[Survived] ConditionalExpression
src/Register.jsx:175:26
             />
             <p
               id="pwdnote"
-              className={pwdFocus && !validPwd ? "instructions" : "offscreen"}
+              className={true ? "instructions" : "offscreen"}
             >
               <FontAwesomeIcon icon={faInfoCircle} />

[Survived] LogicalOperator
src/Register.jsx:175:26
             />
             <p
               id="pwdnote"
-              className={pwdFocus && !validPwd ? "instructions" : "offscreen"}
+              className={pwdFocus || !validPwd ? "instructions" : "offscreen"}
             >
               <FontAwesomeIcon icon={faInfoCircle} />

[Survived] StringLiteral
src/Register.jsx:184:60
               special character.
               <br />
               Allowed special characters:{" "}
-              <span aria-label="exclamation mark">!</span>{" "}
+              <span aria-label="exclamation mark">!</span>{""}
               <span aria-label="at symbol">@</span>{" "}
               <span aria-label="hashtag">#</span>{" "}

[Survived] StringLiteral
src/Register.jsx:186:51
               Allowed special characters:{" "}
               <span aria-label="exclamation mark">!</span>{" "}
               <span aria-label="at symbol">@</span>{" "}
-              <span aria-label="hashtag">#</span>{" "}
+              <span aria-label="hashtag">#</span>{""}
               <span aria-label="dollar sign">$</span>{" "}
               <span aria-label="percent">%</span>

[Survived] StringLiteral
src/Register.jsx:187:55
               <span aria-label="exclamation mark">!</span>{" "}
               <span aria-label="at symbol">@</span>{" "}
               <span aria-label="hashtag">#</span>{" "}
-              <span aria-label="dollar sign">$</span>{" "}
+              <span aria-label="dollar sign">$</span>{""}
               <span aria-label="percent">%</span>
             </p>

[Survived] ConditionalExpression
src/Register.jsx:195:28
               Confirm Password:
               <FontAwesomeIcon
                 icon={faCheck}
-                className={validMatch && matchPwd ? "valid" : "hide"}
+                className={true ? "valid" : "hide"}
               />
               <FontAwesomeIcon

[Survived] ConditionalExpression
src/Register.jsx:195:28
               Confirm Password:
               <FontAwesomeIcon
                 icon={faCheck}
-                className={validMatch && matchPwd ? "valid" : "hide"}
+                className={false ? "valid" : "hide"}
               />
               <FontAwesomeIcon

[Survived] ConditionalExpression
src/Register.jsx:199:28
               />
               <FontAwesomeIcon
                 icon={faTimes}
-                className={validMatch || !matchPwd ? "hide" : "invalid"}
+                className={false ? "hide" : "invalid"}
               />
             </label>

[Survived] LogicalOperator
src/Register.jsx:199:28
               />
               <FontAwesomeIcon
                 icon={faTimes}
-                className={validMatch || !matchPwd ? "hide" : "invalid"}
+                className={validMatch && !matchPwd ? "hide" : "invalid"}
               />
             </label>

[Killed] ArrowFunction
src/Register.jsx:205:25
             <input
               type="password"
               id="confirm_pwd"
-              onChange={(e) => setMatchPwd(e.target.value)}
+              onChange={() => undefined}
               value={matchPwd}
               required
killedBy: Register Component submits the form successfully
statusReason: Error: Unable to find an element with the text: /success/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        aria-live="assertive"

[NoCoverage] BooleanLiteral
src/Register.jsx:210:44
               required
               aria-invalid={validMatch ? "false" : "true"}
               aria-describedby="confirmnote"
-              onFocus={() => setMatchFocus(true)}
+              onFocus={() => setMatchFocus(false)}
               onBlur={() => setMatchFocus(false)}
               autoComplete="off"

[Survived] ArrowFunction
src/Register.jsx:210:24
               required
               aria-invalid={validMatch ? "false" : "true"}
               aria-describedby="confirmnote"
-              onFocus={() => setMatchFocus(true)}
+              onFocus={() => undefined}
               onBlur={() => setMatchFocus(false)}
               autoComplete="off"

[Survived] ArrowFunction
src/Register.jsx:211:23
               aria-invalid={validMatch ? "false" : "true"}
               aria-describedby="confirmnote"
               onFocus={() => setMatchFocus(true)}
-              onBlur={() => setMatchFocus(false)}
+              onBlur={() => undefined}
               autoComplete="off"
             />
