[NoCoverage] BooleanLiteral
src/Register.jsx:211:43
               aria-invalid={validMatch ? "false" : "true"}
               aria-describedby="confirmnote"
               onFocus={() => setMatchFocus(true)}
-              onBlur={() => setMatchFocus(false)}
+              onBlur={() => setMatchFocus(true)}
               autoComplete="off"
             />

[NoCoverage] BooleanLiteral
src/Register.jsx:217:31
             <p
               id="confirmnote"
               className={
-                matchFocus && !validMatch ? "instructions" : "offscreen"
+                matchFocus && validMatch ? "instructions" : "offscreen"
               }
             >

[Survived] LogicalOperator
src/Register.jsx:217:17
             <p
               id="confirmnote"
               className={
-                matchFocus && !validMatch ? "instructions" : "offscreen"
+                matchFocus || !validMatch ? "instructions" : "offscreen"
               }
             >

[Killed] LogicalOperator
src/Register.jsx:224:25
               Must match the first password input field.
             </p>
             <button
-              disabled={!validName || !validPwd || !validMatch ? true : false}
+              disabled={(!validName || !validPwd) && !validMatch ? true : false}
             >
               Sign Up
killedBy: Register Component prevents submission with invalid inputs
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button />

[Killed] BooleanLiteral
src/Register.jsx:224:66
               Must match the first password input field.
             </p>
             <button
-              disabled={!validName || !validPwd || !validMatch ? true : false}
+              disabled={!validName || !validPwd || !validMatch ? false : false}
             >
               Sign Up
killedBy: Register Component prevents submission with invalid inputs
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button />
