[Killed] ObjectLiteral
src/StudentDetails.jsx:6:25
 import { faCheck, faTimes, faInfoCircle } from "@fortawesome/free-solid-svg-icons";
 import "./details.css";
 
-const validationRules = {
-  name: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
-  mothersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
-  fathersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
-  address: {
-    regex: /^[A-Za-z0-9\s\-\/]+$/,
-    message: "Only letters, numbers, spaces, hyphens (-), and slashes (/) are allowed.",
-  },
-  city: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
-  phoneNumber: { regex: /^\d{10}$/, message: "Must be exactly 10 digits." },
-  email: {
-    regex: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-    message: "Must be a valid email address.",
-  },
-  postalCode: { regex: /^\d{5,6}$/, message: "Must be 5-6 digits." },
-  dateOfBirth: { regex: /.+/, message: "This field cannot be empty." },
-  salary: { regex: /^\d{4,}$/, message: "Must be at least 4 digits." },
-};
+const validationRules = {};
 
 const StudentDetails = () => {
killedBy: StudentDetails Form renders all form fields with correct labels
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Name :

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        class="offscreen"

[Killed] StringLiteral
src/StudentDetails.jsx:7:44
 import "./details.css";
 
 const validationRules = {
-  name: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
+  name: { regex: /^[A-Za-z\s]+$/, message: "" },
   mothersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   fathersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
killedBy: StudentDetails Form shows validation hints when fields are focused
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Only alphabets are allowed/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        class="offscreen"

[Killed] Regex
src/StudentDetails.jsx:7:18
 import "./details.css";
 
 const validationRules = {
-  name: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
+  name: { regex: /^[A-Za-z\S]+$/, message: "Only alphabets are allowed." },
   mothersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   fathersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
killedBy: StudentDetails Form validates 'Name' field correctly
statusReason: Error: Unable to find an element with the text: /Only alphabets are allowed./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        class="offscreen"

[Survived] StringLiteral
src/StudentDetails.jsx:8:51
 
 const validationRules = {
   name: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
-  mothersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
+  mothersName: { regex: /^[A-Za-z\s]+$/, message: "" },
   fathersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   address: {

[Survived] Regex
src/StudentDetails.jsx:8:25
 
 const validationRules = {
   name: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
-  mothersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
+  mothersName: { regex: /[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   fathersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   address: {

[Killed] Regex
src/StudentDetails.jsx:9:25
 const validationRules = {
   name: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   mothersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
-  fathersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
+  fathersName: { regex: /^[A-Za-z\S]+$/, message: "Only alphabets are allowed." },
   address: {
     regex: /^[A-Za-z0-9\s\-\/]+$/,
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(element).not.toBeDisabled()

Received element is disabled:
  <button disabled="" type="submit" />

[Survived] StringLiteral
src/StudentDetails.jsx:9:51
 const validationRules = {
   name: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   mothersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
-  fathersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
+  fathersName: { regex: /^[A-Za-z\s]+$/, message: "" },
   address: {
     regex: /^[A-Za-z0-9\s\-\/]+$/,

[Killed] Regex
src/StudentDetails.jsx:11:12
   mothersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   fathersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   address: {
-    regex: /^[A-Za-z0-9\s\-\/]+$/,
+    regex: /^[A-Za-z0-9\s\-\/]$/,
     message: "Only letters, numbers, spaces, hyphens (-), and slashes (/) are allowed.",
   },
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(element).not.toBeDisabled()

Received element is disabled:
  <button disabled="" type="submit" />

[Killed] Regex
src/StudentDetails.jsx:11:12
   mothersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   fathersName: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   address: {
-    regex: /^[A-Za-z0-9\s\-\/]+$/,
+    regex: /^[^A-Za-z0-9\s\-\/]+$/,
     message: "Only letters, numbers, spaces, hyphens (-), and slashes (/) are allowed.",
   },
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(element).not.toBeDisabled()

Received element is disabled:
  <button disabled="" type="submit" />

[Killed] Regex
src/StudentDetails.jsx:14:18
     regex: /^[A-Za-z0-9\s\-\/]+$/,
     message: "Only letters, numbers, spaces, hyphens (-), and slashes (/) are allowed.",
   },
-  city: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
+  city: { regex: /^[A-Za-z\s]$/, message: "Only alphabets are allowed." },
   phoneNumber: { regex: /^\d{10}$/, message: "Must be exactly 10 digits." },
   email: {
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(element).not.toBeDisabled()

Received element is disabled:
  <button disabled="" type="submit" />

[Survived] Regex
src/StudentDetails.jsx:14:18
     regex: /^[A-Za-z0-9\s\-\/]+$/,
     message: "Only letters, numbers, spaces, hyphens (-), and slashes (/) are allowed.",
   },
-  city: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
+  city: { regex: /[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   phoneNumber: { regex: /^\d{10}$/, message: "Must be exactly 10 digits." },
   email: {

[Killed] Regex
src/StudentDetails.jsx:15:25
     message: "Only letters, numbers, spaces, hyphens (-), and slashes (/) are allowed.",
   },
   city: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
-  phoneNumber: { regex: /^\d{10}$/, message: "Must be exactly 10 digits." },
+  phoneNumber: { regex: /^\D{10}$/, message: "Must be exactly 10 digits." },
   email: {
     regex: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
killedBy: StudentDetails Form validates 'Phone Number' field correctly
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="instructions">Must be exactly 10 digits.</p> instead

[Killed] Regex
src/StudentDetails.jsx:17:12
   city: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   phoneNumber: { regex: /^\d{10}$/, message: "Must be exactly 10 digits." },
   email: {
-    regex: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
+    regex: /^[^\S@]+@[^\s@]+\.[^\s@]+$/,
     message: "Must be a valid email address.",
   },
killedBy: StudentDetails Form validates 'Email' field correctly
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="instructions">Must be a valid email address.</p> instead

[Killed] Regex
src/StudentDetails.jsx:17:12
   city: { regex: /^[A-Za-z\s]+$/, message: "Only alphabets are allowed." },
   phoneNumber: { regex: /^\d{10}$/, message: "Must be exactly 10 digits." },
   email: {
-    regex: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
+    regex: /^[\s@]+@[^\s@]+\.[^\s@]+$/,
     message: "Must be a valid email address.",
   },
killedBy: StudentDetails Form validates 'Email' field correctly
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="instructions">Must be a valid email address.</p> instead

[Killed] Regex
src/StudentDetails.jsx:20:24
     regex: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
     message: "Must be a valid email address.",
   },
-  postalCode: { regex: /^\d{5,6}$/, message: "Must be 5-6 digits." },
+  postalCode: { regex: /^\D{5,6}$/, message: "Must be 5-6 digits." },
   dateOfBirth: { regex: /.+/, message: "This field cannot be empty." },
   salary: { regex: /^\d{4,}$/, message: "Must be at least 4 digits." },
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(element).not.toBeDisabled()

Received element is disabled:
  <button disabled="" type="submit" />

[Survived] Regex
src/StudentDetails.jsx:20:24
     regex: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
     message: "Must be a valid email address.",
   },
-  postalCode: { regex: /^\d{5,6}$/, message: "Must be 5-6 digits." },
+  postalCode: { regex: /\d{5,6}$/, message: "Must be 5-6 digits." },
   dateOfBirth: { regex: /.+/, message: "This field cannot be empty." },
   salary: { regex: /^\d{4,}$/, message: "Must be at least 4 digits." },

[Survived] Regex
src/StudentDetails.jsx:21:25
     message: "Must be a valid email address.",
   },
   postalCode: { regex: /^\d{5,6}$/, message: "Must be 5-6 digits." },
-  dateOfBirth: { regex: /.+/, message: "This field cannot be empty." },
+  dateOfBirth: { regex: /./, message: "This field cannot be empty." },
   salary: { regex: /^\d{4,}$/, message: "Must be at least 4 digits." },
 };

[Survived] BooleanLiteral
src/StudentDetails.jsx:30:50
   const [validFields, setValidFields] = useState({});
   const [touchedFields, setTouchedFields] = useState({});
   const [errMsg, setErrMsg] = useState("");
-  const [isFormValid, setIsFormValid] = useState(false);
+  const [isFormValid, setIsFormValid] = useState(true);
   const errRef = useRef();
 

[Killed] BlockStatement
src/StudentDetails.jsx:34:19
   const errRef = useRef();
 
   // Validate all fields whenever formData or validFields changes
-  useEffect(() => {
-    const allFieldsValid = Object.keys(validationRules).every(
-      (key) => validFields[key] && formData[key]
-    );
-    setIsFormValid(allFieldsValid);
-  }, [formData, validFields]);
+  useEffect(() => {}, [formData, validFields]);
 
   const handleChange = (e) => {
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(element).not.toBeDisabled()

Received element is disabled:
  <button disabled="" type="submit" />

[Survived] MethodExpression
src/StudentDetails.jsx:35:28
 
   // Validate all fields whenever formData or validFields changes
   useEffect(() => {
-    const allFieldsValid = Object.keys(validationRules).every(
-      (key) => validFields[key] && formData[key]
-    );
+    const allFieldsValid = Object.keys(validationRules).some(key => validFields[key] && formData[key]);
     setIsFormValid(allFieldsValid);
   }, [formData, validFields]);

[Killed] ArrowFunction
src/StudentDetails.jsx:36:7
   // Validate all fields whenever formData or validFields changes
   useEffect(() => {
     const allFieldsValid = Object.keys(validationRules).every(
-      (key) => validFields[key] && formData[key]
+      () => undefined
     );
     setIsFormValid(allFieldsValid);
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(element).not.toBeDisabled()

Received element is disabled:
  <button disabled="" type="submit" />

[Killed] ConditionalExpression
src/StudentDetails.jsx:36:16
   // Validate all fields whenever formData or validFields changes
   useEffect(() => {
     const allFieldsValid = Object.keys(validationRules).every(
-      (key) => validFields[key] && formData[key]
+      (key) => true
     );
     setIsFormValid(allFieldsValid);
killedBy: StudentDetails Form validates date of birth field correctly
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button type="submit" />

[Killed] BlockStatement
src/StudentDetails.jsx:41:31
     setIsFormValid(allFieldsValid);
   }, [formData, validFields]);
 
-  const handleChange = (e) => {
-    const { name, value } = e.target;
-    setFormData({ ...formData, [name]: value });
-    setValidFields({ ...validFields, [name]: validationRules[name].regex.test(value) });
-  };
+  const handleChange = (e) => {};
 
   const handleSubmit = (e) => {
killedBy: StudentDetails Form validates 'Phone Number' field correctly
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="instructions">Must be exactly 10 digits.</p> instead

[Killed] ObjectLiteral
src/StudentDetails.jsx:44:20
   const handleChange = (e) => {
     const { name, value } = e.target;
     setFormData({ ...formData, [name]: value });
-    setValidFields({ ...validFields, [name]: validationRules[name].regex.test(value) });
+    setValidFields({});
   };
 
killedBy: StudentDetails Form validates 'Phone Number' field correctly
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="instructions">Must be exactly 10 digits.</p> instead

[Killed] BlockStatement
src/StudentDetails.jsx:47:31
     setValidFields({ ...validFields, [name]: validationRules[name].regex.test(value) });
   };
 
-  const handleSubmit = (e) => {
-    e.preventDefault();
-
-    // Check all fields for validity
-    const invalidFields = Object.keys(validationRules).filter(
-      (key) => !validFields[key] || !formData[key]
-    );
-
-    if (invalidFields.length > 0) {
-      setErrMsg("Please fill out all fields correctly.");
-      return;
-    }
-
-    // If all fields are valid
-    setErrMsg("");
-    alert("Form submitted successfully!");
-  };
+  const handleSubmit = (e) => {};
 
   return (
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Form submitted successfully!"

Number of calls: 0

[Killed] MethodExpression
src/StudentDetails.jsx:51:27
     e.preventDefault();
 
     // Check all fields for validity
-    const invalidFields = Object.keys(validationRules).filter(
-      (key) => !validFields[key] || !formData[key]
-    );
+    const invalidFields = Object.keys(validationRules);
 
     if (invalidFields.length > 0) {
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Form submitted successfully!"

Number of calls: 0

[Killed] BooleanLiteral
src/StudentDetails.jsx:52:16
 
     // Check all fields for validity
     const invalidFields = Object.keys(validationRules).filter(
-      (key) => !validFields[key] || !formData[key]
+      (key) => validFields[key] || !formData[key]
     );
 
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Form submitted successfully!"

Number of calls: 0

[Killed] BooleanLiteral
src/StudentDetails.jsx:52:37
 
     // Check all fields for validity
     const invalidFields = Object.keys(validationRules).filter(
-      (key) => !validFields[key] || !formData[key]
+      (key) => !validFields[key] || formData[key]
     );
 
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Form submitted successfully!"

Number of calls: 0

[Killed] ConditionalExpression
src/StudentDetails.jsx:55:9
       (key) => !validFields[key] || !formData[key]
     );
 
-    if (invalidFields.length > 0) {
+    if (true) {
       setErrMsg("Please fill out all fields correctly.");
       return;
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Form submitted successfully!"

Number of calls: 0

[Killed] EqualityOperator
src/StudentDetails.jsx:55:9
       (key) => !validFields[key] || !formData[key]
     );
 
-    if (invalidFields.length > 0) {
+    if (invalidFields.length <= 0) {
       setErrMsg("Please fill out all fields correctly.");
       return;
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Form submitted successfully!"

Number of calls: 0

[Killed] ArrowFunction
src/StudentDetails.jsx:72:43
       </p>
       <h1>Student Details Form</h1>
       <form onSubmit={handleSubmit}>
-        {Object.keys(validationRules).map((key) => (
-          <InputField
-            key={key}
-            id={key}
-            label={key.replace(/([A-Z])/g, " $1").replace(/^./, (str) => str.toUpperCase()) + " :"}
-            value={formData[key] || ""}
-            isValid={validFields[key]}
-            touched={touchedFields[key]}
-            onChange={handleChange}
-            onFocus={() => setTouchedFields({ ...touchedFields, [key]: true })}
-            validationMessage={
-              touchedFields[key] && !validFields[key] ? validationRules[key].message : null
-            }
-            type={key === "dateOfBirth" ? "date" : key === "email" ? "email" : "text"}
-          />
-        ))}
+        {Object.keys(validationRules).map(() => undefined)}
         <button type="submit" disabled={!isFormValid}>
           Submit
killedBy: StudentDetails Form renders all form fields with correct labels
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Name :

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        class="offscreen"

[Killed] ArrowFunction
src/StudentDetails.jsx:76:65
           <InputField
             key={key}
             id={key}
-            label={key.replace(/([A-Z])/g, " $1").replace(/^./, (str) => str.toUpperCase()) + " :"}
+            label={key.replace(/([A-Z])/g, " $1").replace(/^./, () => undefined) + " :"}
             value={formData[key] || ""}
             isValid={validFields[key]}
killedBy: StudentDetails Form renders all form fields with correct labels
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Name :

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        class="offscreen"

[Killed] MethodExpression
src/StudentDetails.jsx:76:74
           <InputField
             key={key}
             id={key}
-            label={key.replace(/([A-Z])/g, " $1").replace(/^./, (str) => str.toUpperCase()) + " :"}
+            label={key.replace(/([A-Z])/g, " $1").replace(/^./, (str) => str.toLowerCase()) + " :"}
             value={formData[key] || ""}
             isValid={validFields[key]}
killedBy: StudentDetails Form renders all form fields with correct labels
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Name :

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        class="offscreen"

[Killed] LogicalOperator
src/StudentDetails.jsx:77:20
             key={key}
             id={key}
             label={key.replace(/([A-Z])/g, " $1").replace(/^./, (str) => str.toUpperCase()) + " :"}
-            value={formData[key] || ""}
+            value={formData[key] && ""}
             isValid={validFields[key]}
             touched={touchedFields[key]}
killedBy: StudentDetails Form validates date of birth field correctly
statusReason: Error: expect(element).toHaveValue(2000-01-01)

Expected the element to have value:
  2000-01-01
Received:

[Killed] ConditionalExpression
src/StudentDetails.jsx:77:20
             key={key}
             id={key}
             label={key.replace(/([A-Z])/g, " $1").replace(/^./, (str) => str.toUpperCase()) + " :"}
-            value={formData[key] || ""}
+            value={true}
             isValid={validFields[key]}
             touched={touchedFields[key]}
killedBy: StudentDetails Form validates date of birth field correctly
statusReason: Error: expect(element).toHaveValue(2000-01-01)

Expected the element to have value:
  2000-01-01
Received:

[Killed] BooleanLiteral
src/StudentDetails.jsx:81:72
             isValid={validFields[key]}
             touched={touchedFields[key]}
             onChange={handleChange}
-            onFocus={() => setTouchedFields({ ...touchedFields, [key]: true })}
+            onFocus={() => setTouchedFields({ ...touchedFields, [key]: false })}
             validationMessage={
               touchedFields[key] && !validFields[key] ? validationRules[key].message : null
killedBy: StudentDetails Form shows validation hints when fields are focused
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Only alphabets are allowed/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        class="offscreen"

[Killed] ArrowFunction
src/StudentDetails.jsx:81:22
             isValid={validFields[key]}
             touched={touchedFields[key]}
             onChange={handleChange}
-            onFocus={() => setTouchedFields({ ...touchedFields, [key]: true })}
+            onFocus={() => undefined}
             validationMessage={
               touchedFields[key] && !validFields[key] ? validationRules[key].message : null
killedBy: StudentDetails Form shows validation hints when fields are focused
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Only alphabets are allowed/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        class="offscreen"

[Killed] LogicalOperator
src/StudentDetails.jsx:83:15
             onChange={handleChange}
             onFocus={() => setTouchedFields({ ...touchedFields, [key]: true })}
             validationMessage={
-              touchedFields[key] && !validFields[key] ? validationRules[key].message : null
+              touchedFields[key] || !validFields[key] ? validationRules[key].message : null
             }
             type={key === "dateOfBirth" ? "date" : key === "email" ? "email" : "text"}
killedBy: StudentDetails Form shows validation hints when fields are focused
statusReason: TestingLibraryElementError: Found multiple elements with the text: /Only alphabets are allowed/i

Here are the matching elements:

Ignored nodes: comments, script, style
<p
  class="instructions"
>

[Killed] ConditionalExpression
src/StudentDetails.jsx:83:15
             onChange={handleChange}
             onFocus={() => setTouchedFields({ ...touchedFields, [key]: true })}
             validationMessage={
-              touchedFields[key] && !validFields[key] ? validationRules[key].message : null
+              false ? validationRules[key].message : null
             }
             type={key === "dateOfBirth" ? "date" : key === "email" ? "email" : "text"}
killedBy: StudentDetails Form shows validation hints when fields are focused
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Only alphabets are allowed/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        class="offscreen"

[Killed] EqualityOperator
src/StudentDetails.jsx:85:19
             validationMessage={
               touchedFields[key] && !validFields[key] ? validationRules[key].message : null
             }
-            type={key === "dateOfBirth" ? "date" : key === "email" ? "email" : "text"}
+            type={key !== "dateOfBirth" ? "date" : key === "email" ? "email" : "text"}
           />
         ))}
killedBy: StudentDetails Form validates 'Phone Number' field correctly
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="instructions">Must be exactly 10 digits.</p> instead

[Killed] EqualityOperator
src/StudentDetails.jsx:85:52
             validationMessage={
               touchedFields[key] && !validFields[key] ? validationRules[key].message : null
             }
-            type={key === "dateOfBirth" ? "date" : key === "email" ? "email" : "text"}
+            type={key === "dateOfBirth" ? "date" : key !== "email" ? "email" : "text"}
           />
         ))}
killedBy: StudentDetails Form Submit button is enabled when form is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Form submitted successfully!"

Number of calls: 0

[Killed] BooleanLiteral
src/StudentDetails.jsx:88:41
             type={key === "dateOfBirth" ? "date" : key === "email" ? "email" : "text"}
           />
         ))}
-        <button type="submit" disabled={!isFormValid}>
+        <button type="submit" disabled={isFormValid}>
           Submit
         </button>
killedBy: StudentDetails Form validates date of birth field correctly
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button type="submit" />

[Survived] LogicalOperator
src/StudentDetails.jsx:113:20
       <FontAwesomeIcon icon={faCheck} className={isValid ? "valid" : "hide"} />
       <FontAwesomeIcon
         icon={faTimes}
-        className={!isValid && (value || touched) ? "invalid" : "hide"}
+        className={!isValid || value || touched ? "invalid" : "hide"}
       />
     </label>

[Survived] LogicalOperator
src/StudentDetails.jsx:113:33
       <FontAwesomeIcon icon={faCheck} className={isValid ? "valid" : "hide"} />
       <FontAwesomeIcon
         icon={faTimes}
-        className={!isValid && (value || touched) ? "invalid" : "hide"}
+        className={!isValid && (value && touched) ? "invalid" : "hide"}
       />
     </label>

[Survived] ConditionalExpression
src/StudentDetails.jsx:123:21
       value={value}
       onChange={onChange}
       onFocus={onFocus}
-      aria-invalid={!isValid && touched ? "true" : "false"}
+      aria-invalid={false ? "true" : "false"}
     />
     {validationMessage && <p className="instructions">{validationMessage}</p>}

[Survived] LogicalOperator
src/StudentDetails.jsx:123:21
       value={value}
       onChange={onChange}
       onFocus={onFocus}
-      aria-invalid={!isValid && touched ? "true" : "false"}
+      aria-invalid={!isValid || touched ? "true" : "false"}
     />
     {validationMessage && <p className="instructions">{validationMessage}</p>}

[Killed] ConditionalExpression
src/StudentDetails.jsx:125:6
       onFocus={onFocus}
       aria-invalid={!isValid && touched ? "true" : "false"}
     />
-    {validationMessage && <p className="instructions">{validationMessage}</p>}
+    {false}
   </div>
 );
killedBy: StudentDetails Form shows validation hints when fields are focused
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Only alphabets are allowed/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        class="offscreen"

[Killed] ConditionalExpression
src/StudentDetails.jsx:125:6
       onFocus={onFocus}
       aria-invalid={!isValid && touched ? "true" : "false"}
     />
-    {validationMessage && <p className="instructions">{validationMessage}</p>}
+    {true}
   </div>
 );
killedBy: StudentDetails Form shows validation hints when fields are focused
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Only alphabets are allowed/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section>
      <p
        class="offscreen"
