[Survived] ObjectLiteral
src/api/axios.js:3:29
 import axios from "axios";
 
-export default axios.create({
-  baseURL: "http://localhost:5000",
-});
+export default axios.create({});
 

[Survived] StringLiteral
src/api/axios.js:4:12
 import axios from "axios";
 
 export default axios.create({
-  baseURL: "http://localhost:5000",
+  baseURL: "",
 });
 
